{
  "[PAD]": 0,
  "[BOS]": 1,
  "[EOS]": 2,
  "[UNK]": 3,
  ".": 4,
  "[#11C]": 5,
  "[#As]": 6,
  "[#Branch1]": 7,
  "[#Branch2]": 8,
  "[#C-1]": 9,
  "[#C]": 10,
  "[#In]": 11,
  "[#N+1]": 12,
  "[#N]": 13,
  "[#Sb]": 14,
  "[#Si+1]": 15,
  "[-/Ring1]": 16,
  "[-/Ring2]": 17,
  "[-\\Ring1]": 18,
  "[-\\Ring2]": 19,
  "[/-Ring1]": 20,
  "[/123I]": 21,
  "[/125I]": 22,
  "[/131I]": 23,
  "[/14CH1]": 24,
  "[/B]": 25,
  "[/Br]": 26,
  "[/C-1]": 27,
  "[/C@@H1]": 28,
  "[/C@@]": 29,
  "[/C@H1]": 30,
  "[/C@]": 31,
  "[/C]": 32,
  "[/Cl]": 33,
  "[/F]": 34,
  "[/I]": 35,
  "[/N+1]": 36,
  "[/N-1]": 37,
  "[/NH1]": 38,
  "[/N]": 39,
  "[/O-1]": 40,
  "[/O]": 41,
  "[/P@@]": 42,
  "[/P]": 43,
  "[/S+1]": 44,
  "[/S-1]": 45,
  "[/S]": 46,
  "[/Se]": 47,
  "[/Si]": 48,
  "[10B]": 49,
  "[11CH1]": 50,
  "[11CH3]": 51,
  "[11C]": 52,
  "[123I]": 53,
  "[123Te]": 54,
  "[124I]": 55,
  "[125IH1]": 56,
  "[125I]": 57,
  "[127I]": 58,
  "[131I]": 59,
  "[13CH2]": 60,
  "[13CH3]": 61,
  "[13C]": 62,
  "[14C@@H1]": 63,
  "[14C@@]": 64,
  "[14C@H1]": 65,
  "[14CH1]": 66,
  "[14CH2]": 67,
  "[14CH3]": 68,
  "[14C]": 69,
  "[15NH1]": 70,
  "[17F]": 71,
  "[18F-1]": 72,
  "[18F]": 73,
  "[19F]": 74,
  "[211At]": 75,
  "[2H]": 76,
  "[32P]": 77,
  "[35S]": 78,
  "[3H]": 79,
  "[68Ga+3]": 80,
  "[73Se]": 81,
  "[75Se]": 82,
  "[76Br]": 83,
  "[=11C]": 84,
  "[=14CH1]": 85,
  "[=14C]": 86,
  "[=18O]": 87,
  "[=Al]": 88,
  "[=As]": 89,
  "[=Branch1]": 90,
  "[=Branch2]": 91,
  "[=C+1]": 92,
  "[=C]": 93,
  "[=Cd]": 94,
  "[=Co]": 95,
  "[=Cr]": 96,
  "[=Mo]": 97,
  "[=N+1]": 98,
  "[=N-1]": 99,
  "[=NH1+1]": 100,
  "[=NH2+1]": 101,
  "[=N]": 102,
  "[=Ni]": 103,
  "[=O+1]": 104,
  "[=O]": 105,
  "[=P@@]": 106,
  "[=P@]": 107,
  "[=PH1]": 108,
  "[=P]": 109,
  "[=Ring1]": 110,
  "[=Ring2]": 111,
  "[=S+1]": 112,
  "[=S-1]": 113,
  "[=S@@]": 114,
  "[=S@]": 115,
  "[=SH0]": 116,
  "[=SH1]": 117,
  "[=S]": 118,
  "[=Se+1]": 119,
  "[=Se]": 120,
  "[=Si]": 121,
  "[=Te+1]": 122,
  "[=Te]": 123,
  "[=Ti]": 124,
  "[=V]": 125,
  "[=Zr]": 126,
  "[Ag+1]": 127,
  "[Ag]": 128,
  "[Al+3]": 129,
  "[Al]": 130,
  "[As+1]": 131,
  "[As+3]": 132,
  "[As]": 133,
  "[At]": 134,
  "[B-1]": 135,
  "[B@-1]": 136,
  "[B@@-1]": 137,
  "[BH0]": 138,
  "[BH1-1]": 139,
  "[BH2-1]": 140,
  "[BH3-1]": 141,
  "[B]": 142,
  "[Ba+2]": 143,
  "[Be+2]": 144,
  "[Be]": 145,
  "[Bi+3]": 146,
  "[Br-1]": 147,
  "[Br]": 148,
  "[Branch1]": 149,
  "[Branch2]": 150,
  "[Branch3]": 151,
  "[C+1]": 152,
  "[C-1]": 153,
  "[C@@H1]": 154,
  "[C@@]": 155,
  "[C@H1]": 156,
  "[C@]": 157,
  "[CH1-1]": 158,
  "[C]": 159,
  "[Ca+2]": 160,
  "[CaH2]": 161,
  "[Ca]": 162,
  "[Cd+2]": 163,
  "[Cd]": 164,
  "[Cl+1]": 165,
  "[Cl+3]": 166,
  "[Cl-1]": 167,
  "[Cl]": 168,
  "[Co+2]": 169,
  "[Cr+3]": 170,
  "[Cr]": 171,
  "[Cs+1]": 172,
  "[Cu+2]": 173,
  "[Cu]": 174,
  "[F]": 175,
  "[Fe+2]": 176,
  "[Fe+3]": 177,
  "[Ga]": 178,
  "[H+1]": 179,
  "[HH1]": 180,
  "[Hg]": 181,
  "[I+1]": 182,
  "[I+3]": 183,
  "[I-1]": 184,
  "[I]": 185,
  "[K+1]": 186,
  "[Li+1]": 187,
  "[LiH1]": 188,
  "[Mg+1]": 189,
  "[Mg+2]": 190,
  "[MgH2]": 191,
  "[Mg]": 192,
  "[N+1]": 193,
  "[N-1]": 194,
  "[N@+1]": 195,
  "[N@@+1]": 196,
  "[N@@]": 197,
  "[N@H1+1]": 198,
  "[N@]": 199,
  "[NH1+1]": 200,
  "[NH1-1]": 201,
  "[NH1]": 202,
  "[NH2+1]": 203,
  "[NH3+1]": 204,
  "[NH4+1]": 205,
  "[N]": 206,
  "[Na+1]": 207,
  "[NaH1]": 208,
  "[Na]": 209,
  "[Ni+2]": 210,
  "[Ni]": 211,
  "[O+1]": 212,
  "[O-1]": 213,
  "[O-2]": 214,
  "[OH0]": 215,
  "[OH1-1]": 216,
  "[OH3+1]": 217,
  "[O]": 218,
  "[P+1]": 219,
  "[P-1]": 220,
  "[P@+1]": 221,
  "[P@@+1]": 222,
  "[P@@]": 223,
  "[P@]": 224,
  "[PH1]": 225,
  "[PH2+1]": 226,
  "[P]": 227,
  "[Pb+2]": 228,
  "[Pb]": 229,
  "[Pu]": 230,
  "[Rb+1]": 231,
  "[Ring1]": 232,
  "[Ring2]": 233,
  "[S+1]": 234,
  "[S-1]": 235,
  "[S-2]": 236,
  "[S@+1]": 237,
  "[S@@+1]": 238,
  "[S@@]": 239,
  "[S@]": 240,
  "[SH1+1]": 241,
  "[SH1]": 242,
  "[S]": 243,
  "[Sb+3]": 244,
  "[Sb]": 245,
  "[Se+1]": 246,
  "[SeH1]": 247,
  "[Se]": 248,
  "[Si-1]": 249,
  "[SiH1-1]": 250,
  "[SiH1]": 251,
  "[SiH2]": 252,
  "[SiH3-1]": 253,
  "[SiH4]": 254,
  "[Si]": 255,
  "[Sn]": 256,
  "[Sr+2]": 257,
  "[Te-1]": 258,
  "[TeH2]": 259,
  "[Te]": 260,
  "[V]": 261,
  "[Yb]": 262,
  "[Zn+1]": 263,
  "[Zn+2]": 264,
  "[Zn-2]": 265,
  "[Zn]": 266,
  "[\\-Ring1]": 267,
  "[\\-Ring2]": 268,
  "[\\11CH3]": 269,
  "[\\123I]": 270,
  "[\\125I]": 271,
  "[\\B]": 272,
  "[\\Br]": 273,
  "[\\C@@H1]": 274,
  "[\\C@@]": 275,
  "[\\C@H1]": 276,
  "[\\C@]": 277,
  "[\\C]": 278,
  "[\\Cl]": 279,
  "[\\F]": 280,
  "[\\I]": 281,
  "[\\N+1]": 282,
  "[\\N-1]": 283,
  "[\\NH1-1]": 284,
  "[\\NH1]": 285,
  "[\\N]": 286,
  "[\\O-1]": 287,
  "[\\O]": 288,
  "[\\P]": 289,
  "[\\S+1]": 290,
  "[\\S-1]": 291,
  "[\\S]": 292,
  "[\\Se]": 293,
  "[#B-1]": 294,
  "[#B]": 295,
  "[#Branch3]": 296,
  "[#C+1]": 297,
  "[#O+1]": 298,
  "[#P+1]": 299,
  "[#P-1]": 300,
  "[#P]": 301,
  "[#S+1]": 302,
  "[#S-1]": 303,
  "[#S]": 304,
  "[=B+1]": 305,
  "[=B-1]": 306,
  "[=B]": 307,
  "[=Branch3]": 308,
  "[=C-1]": 309,
  "[=P+1]": 310,
  "[=P-1]": 311,
  "[=Ring3]": 312,
  "[B+1]": 313,
  "[H]": 314,
  "[Ring3]": 315
}